Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: In the OASIS publication Lightweight DITA: An Introduction, we define the MDITA core and extended profiles as follows:
zh_cn: 在OASIS出版的 《轻量级DITA:简介》中，我们定义了MDITA核心和扩展概要如下:

source: In the case of a computational solution for intelligent content, abstraction is a combination of two elements: information representation and separation of concerns (layers of abstraction).
zh_cn: 在智能内容的计算机解决方案中，抽象结合了信息表示和关注点（抽象层）分离的特性。

source: In the committee note Lightweight DITA: An Introduction we point out that the “XDITA and HDITA content models are designed to be functionally equivalent to each other” (Evia et al., 2018, p.
zh_cn: 在委员会资料《轻量级DITA:简介》中，我们指出“XDITA和HDITA内容模型在功能上是对等的” (Evia et al., 2018, p.

source: In the following chapter I introduce a revised version of the layers of abstraction for teaching intelligent content to technical communication students and trainees.
zh_cn: 在接下来的章节中，我将介绍经过修订后的抽象层级，用于教授学习技术传播的学生和学员智能内容。

source: In the following example, the @id attribute on <article> is “franchise-intro”, and the file can be saved as franchise-intro.html (Figure 6.3).
zh_cn: 在下例中，<article>的 @id 属性值是"franchise-intro"，文件保存为franchise-intro.html(图6.3)。

source: In the last section of this chapter I highlight one of the most promising LwDITA features: the ability to create coherent and consistent user deliverables from cross-format sources developed by diverse groups of content creators.
zh_cn: 在本章的最后一节中，我重点介绍了LwDITA最具前景的特性之一：使用不同内容创建团队开发的不同格式的资源，生成统一的用户交付物的能力。

source: In the previous chapter I analyzed the LwDITA document type of map, which works as a collection and organization mechanism for content units.
zh_cn: 在上一章中，我分析了 LwDITA 的地图文档类型，地图的作用是聚合和组织内容单元，

source: In the realm of rhetoric studies, Applen and McDaniel wrote an important text about XML and its implications for rhetorical work.
zh_cn: 在修辞学领域，埃普伦（Applen）和麦克丹尼尔（McDaniel）写了一篇关于XML及其修辞学启示的重要文章。

source: In the specific case of the task topic type, some of those moves included a rationale for the task (“why or when a user would want to perform this task”), prerequisites for the task (“what a user should do before performing this task”), responses to the actions (“what the user should see as a result of doing the action”), examples (“examples of what information to enter or what to do”), and postrequisites for the task (“what to do next after this task is completed”) (Priestley et al.
zh_cn: 特殊情况下的任务主题，一些文步会为这个任务提供合理解释（“为什么或者何时用户想要执行这个任务”），任务的先决条件(“在执行这个任务之前用户应该做什么”)，动作响应(“用户完成动作后应该看到的结果”)，示例（输入的信息示例或指导示例）和任务后决条件(这个任务完成后“下一步该做什么”)(Priestley et al.

source: In the technical communication literature, the concept of abstraction has been linked to Johndan Johnson-Eilola's work to establish “common ground between academic and corporate models” of the profession.
zh_cn: 在关于技术传播的文章中，抽象的概念已经与琼丹·约翰逊-艾劳拉的研究联系起来，以建立技术传播领域“学术界模型和企业模型之间的共同点”。

source: In the world of DITA XML, “a topic is the basic unit of authoring and reuse” (2.2.1.1 The topic as the basic unit of information, 2016).
zh_cn: 在DITA XML世界中，“主题是创作和复用的基本单元” (2.2.1.1 The topic as the basic unit of information, 2016).

source: In the world of rhetoric that defines discourse in most academic programs teaching technical communication in the United States, a topic would actually be one of those content units, and not necessarily the whole “DITA topic.” Confusing?
zh_cn: 美国大多数教授技术传播的学术项目中，话语中充斥着修辞，主题实际上可能只是其中一个内容单元，并不一定就是整个“DITA主题。”是否感到困惑？

source: In the world of scientific and technical communication, DITA and structured authoring are not alone in using concepts of evolution to describe genre change.
zh_cn: 在科技和技术传播的世界里，DITA 和结构化创作并不是唯一使用进化概念来描述体裁变化的。

source: In the “Technical Writing” column, edited by Diana Patterson (she of the prestigious ACM SIGDOC Diana Award), Larry Wygant, of CAPONE - Chicago Area Programmers of Novas and Eclipses, recommended some sections for user manuals aimed at attracting the attention of a reader, who was expected to be male in the “highly selective environment” of old computing described by John Carroll earlier in this chapter.
zh_cn: “技术写作”专栏中，来自Novas and Eclipses芝加哥程序员协会的编辑戴安娜·帕特森(著名计算机协会计算机文档戴安娜奖的创始人)和拉里·怀甘特（Larry Wygant）为用户手册的一些章节做了注释以吸引读者的注意，这里的读者指的是约翰·卡罗尔在本章先前部分描述的旧计算时代“苛刻就业环境下”的男性。

source: In their analysis of the characteristic of “Style,” under the category of “Easy to understand,” the co-authors of DQTI asked readers to “use consistent markup tagging.” A few of their specific recommendations for tagging elements focused on the generic, organizational, and disciplinary implementation of the characteristics into elements: DITA XML.
zh_cn: 在分析“易于理解”这一分类下的“风格”特征时，DQTI的合著者要求读者“使用一致的标记标记。”他们对标记元素的一些具体建议集中于从通用的、组织的和规范三个层面将特征应用至元素上，即DITA XML中

source: In their textbook DITA Best Practices, Bellamy et al.
zh_cn: 在教科书《DITA 最佳实践》（DITA Best Practices）中，贝拉米等人

source: In this book, I follow Guzdial's and Barba's cautious philosophy: developing intelligent content with LwDITA grounded on principles of computational thinking will help communicators produce future-proof content that is ready for automation and is not restricted to one deliverable and one audience.
zh_cn: 在本书中，我遵循古齐亚尔和巴尔巴的谨慎思考，也认为基于计算机思维的原则使用 LwDITA 开发智能内容，将帮助技术传播者生成未永不过时的内容，为自动化做好准备，同时不局限于某一种交付格式或某一类受众。

source: In this case, the “red squiggly of doom” error tells the authors that the topic is not valid and must be fixed.
zh_cn: 在本例中，“预示着坏消息的红色曲线”错误报告告诉写作者，这个话题是无效的，需要修正。

source: In this case, they specify that the topic is Lightweight DITA and not full DITA XML, that it should not allow nested lists, and that it should not allow the inclusion of sections inside the topic.
zh_cn: 在这个例子中，这些指令规定了话题创建自轻量级 DITA 而不是完整的 DITA XML，所以不允许嵌套列表的出现，话题中不能包含子块。

source: In this chapter, I give an overview of each of the three LwDITA flavors (XDITA, HDITA, and MDITA).
zh_cn: 在本章中，我将概述三种LwDITA风格(XDITA、HDITA和MDITA)。

source: In this example (Figure 6.17), Chef Pedro and his team use a definition list to describe the terms that apply to franchise owners of Sensei Sushi.
zh_cn: 在图6.17展示的示例中，厨师佩德罗及其团队使用了定义列表来描述关于 Sensei Sushi 特许经营的术语。

source: In this example, the only content is a placeholder XML comment (marked by the characters <!-- and -->).
zh_cn: 在本例中，唯一的内容是用于占位的 XML 注释（<!-- 和 --> 之间的部分）。

source: In this scenario, however, the simple website from Figure 5.11 would not be enough for the printed Sensei Sushi brochure.
zh_cn: 但是，在这个场景中，图5.11展示的简单网站不足以制作成纸质版的 Sensei Sushi 手册。

source: In this section, I explain an authoring requirement that affects the LwDITA formats based on XML and HTML5.
zh_cn: 在本节中，我将解释影响基于XML和HTML5的LwDITA格式的创作需求。

source: In this section, I will use a software tool to process the DITA map, from Chapter 1, that Chef Pedro created for his recipe critiques website.
zh_cn: 在本节中，我将使用一个软件工具来处理来自第1章的DITA地图，该地图是厨师佩德罗为其菜谱评价网站创建的。

source: In this specific example, the map will only reference those topics that are needed to build a promotional brochure for the Sensei Sushi franchise opportunity.
zh_cn: 在下面这个特定的例子中，地图将只引用那些有助于构建 Sensei Sushi 品牌加盟宣传手册的话题。

source: In using terminology from evolution to describe how genres change (or evolve) in society, Miller does not “want to be under- stood as suggesting that our understanding of cultural change must borrow from biology.
zh_cn: 在使用关于进化的术语来描述社会中体裁如何演化时，米勒并不想“被理解为这是在提倡对文化变革的理解必须借鉴生物学的概念。

source: In writing studies, the process vs. product debate has been pretty much settled since the days of Janet Emig (1977); thus, it is unfair to expect professionals from academia or industry to embrace intelligent content as a product or practice without a detailed process giving steps to achieve it.
zh_cn: 在写作研究中，关于过程和产品的争论在珍妮特·米格 (1997) 的时代就已经基本解决了。因此，期望来自学术界或工业界的专业人员像拥抱某个产品或实践一样拥抱智能内容，而又不给出实现它的详细过程，是不公平的。

source: In Chapter 1 I briefly introduced MDITA, the LwDITA authoring format based on Markdown, and its two content-development profiles 一 core and extended.
zh_cn: 在第一章中，我简要介绍了MDITA，一种基于Markdown的LwDITA创作格式，以及它的两个内容开发概要——核心和扩展。

source: In Chapter 3, I introduced the content and collection components of LwDITA, which can be represented in the three initial authoring formats of the proposed standard.
zh_cn: 在第3章中，我介绍了 LwDITA 的内容和一系列组件，它们可以在提议的 LwDITA 标准中的三种最初的写作格式中使用。

source: Incidentally, this is the first written instance of the LwDITA (or “lwdita” in this case) acronym for Lightweight DITA.
zh_cn: 此外，这是首次用轻量级 DITA 的首字母缩写（LwDITA，或者如本例中的“lwdita”）代替“Lightweight DITA”。

source: Includes decisions about business requirements, user experience, governance, and budget.
zh_cn: 包括关于业务需求、用户体验、管理和预算的决策。

source: Includes decisions about the adoption of content standards and technologies.
zh_cn: 包括关于选择内容标准和所用技术的决策。

source: Includes decisions about the sources of content.
zh_cn: 包括关于内容来源的决策。

source: Includes decisions related to “all the aspects of content that happen after the authoring is done and the content is ready to be sent to its destination”(Bailie & Urbina, 2013, pp.
zh_cn: 包括“在创作完成后，准备将内容发送给目标用户时”与内容的方方面面相关的决策 (Bailie & Urbina, 2013, pp.

source: Individuals authoring content quickly that must be later refactored as structured content
zh_cn: 快速创作内容并需要后续重构为结构化内容的个人

source: Individuals authoring content using a platform, such as a mobile device, that does not support an XML editor
zh_cn: 使用不支持XML编辑器的平台(如移动设备)创作内容的个人

source: Information Mapping topic types: common topic types made up of IM section types (Priestley, 2012a).
zh_cn: 信息映射话题类型：由 IM 节（section）类型组成的常见话题类型（普里斯特利，2012年）。

source: Information developers who use an XML editor but want a smaller set of elements and attributes (compared to DITA) with which to work
zh_cn: 使用XML编辑器但希望元素和属性集(与DITA相比)更少的信息开发人员

source: Information development and content management standards, like DITA and LwDITA, can be good examples of that description, as the process behind their releases can be complicated, and the consensus-driven nature of standards development takes time.
zh_cn: 信息开发和内容管理标准（如DITA和LwDITA）就是印证这句话的很好的例子，因为内容发布背后的过程可能及其复杂，而且标准开发的共识驱动性质需要时间。

source: Information mapping is a system of principles for identifying, categorizing, and interrelating the information required for learning-reference purposes.
zh_cn: 信息映射是一套用于识别、分类和关联学习参考所需信息的系统。

source: Innovative designer
zh_cn: 革新的设计师

source: Inside the body component, the most common unit for small pieces of content is a paragraph (<p>).
zh_cn: 在主体组件中，最常用来表示短小内容块的单元是段落（<p>）。

source: Instead of designing custom tags and depending on a publishing team to design templates and validation tools, he can use DITA's content types and take advantage of the benefits listed by Hackos.
zh_cn: 他可以利用 DITA 提供的内容类型和哈克斯列出的各项优势功能，而无需自己设计特定标签或依赖发布团队来设计模板和检验工具。

source: Instead, authors define their own tags and their relationships.
zh_cn: 相反，作者可以自行定义标签及其关系。

source: Instead, the conversation moved to the idea of separating LwDITA from the DITA standard.
zh_cn: 相反，讨论转向了将 LwDITA 从 DITA 标准中分离出来。

source: Intelligence applied to content development and delivery does not guarantee intelligence in reconciling the needs and perspectives of readers and writers.
zh_cn: 应用于内容开发和交付的智能性无法保证能协调好读者和作者双方之间的需求和观点，

source: Intelligent Content Needs Computational Thinking
zh_cn: 创建智能内容需要计算机思维

source: Intelligent content requires dedication, commitment, and resources.
zh_cn: 智能内容需要作者对写作热忱，投入大量精力，同时也需要各种资源。

source: Intended Audiences for HDITA
zh_cn: HDITA的目标受众

source: Intended Audiences for XDITA
zh_cn: XDITA的目标用户

source: Intended audiences for MDITA
zh_cn: MDITA的目标受众

source: Introduction to the franchise opportunity
zh_cn: 品牌加盟介绍

source: Introduction.
zh_cn: 简介.

source: Is there a LwDITA App?
zh_cn: 有LwDITA应用程序吗?

source: It aims to address concerns and doubts about the adoption and evolution of DITA as a major standard for technical publications.
zh_cn: 它旨在解决人们对采用 DITA 作为技术出版物的主要标准及其发展的担忧和。

source: It also connects the rhetorical structures that drive the evolution of DITA as a standard for technical information to foundational concepts from the field's academic background and to common structures in computing education.
zh_cn: 本书还将推动 DITA 发展为技术信息标准的修辞结构和该领域的基本学术概念、计算机教学中的常见结构联系起来。

source: It assumes a batch, or similar non-interactive, application” (Rigo, 1976, p.
zh_cn: 它假设服务对象是一个批处理或类似的非交互式的应用。”(Rigo, 1976, p.

source: It can also be an on-boarding ramp for full DITA.
zh_cn: 它也是转到完整版本 DITA 的跳板。

source: It can be used in workplace settings and it can also be taught in academic environments for workforce preparation, but also for advancing knowledge in this area.
zh_cn: 计算机思维可以在工作环境中使用，也可以在学术环境中教授，以为日后工作做好准备，同时也可以提高领域知识。

source: It can have an optional title.
zh_cn: 有一个可选标题。

source: It continues the brochure scenario in the different LwDITA authoring formats.
zh_cn: 将继续以宣传手册的例子，结合三种不同的 LwDITA 写作格式来介绍。

source: It does not provide a set of predefined tags.
zh_cn: XML 不提供已经预定义好的标签，

source: It guides authors and lets them know what is required and when they have completed the task in a satisfactory manner.
zh_cn: 它能为创作者提供指导、告知需求并在需求得到满足时告知创作者任务已完成。

source: It includes some examples showing the useful potential of those tags while setting the exigence for LwDITA's simplified content model.
zh_cn: 在设置轻量级DITA的简化内容模型的必备内容时，它包含一些展示标记的潜在用途的示例。

source: It is a manual of instructions on how to use the program or system.
zh_cn: 它是一本指导用户如何使用程序或系统的说明书。

source: It is a markup language, which means that content is enclosed by tags.
zh_cn: XML 是一种标记语言，内容包含在标签内。

source: It is also used to indicate the source for facts or other material used in content.
zh_cn: 也用来表示内容中引用的事实或其他材料的来源。

source: It is common to include a list of illustrations, but no one seems to use them very much” (1976, p.
zh_cn: 手册中加入插图列表很常见，但似乎没人会怎么用它” (1976, p.

source: It is frequently used in chemical and mathematical formulas.
zh_cn: 经常用在化学和数学公式中。

source: It is frequently used in chemical and mathematical formulas; it also is used for footnotes.
zh_cn: 经常用在化学和数学公式中，也用于标注脚注。

source: It is not as though the academic side of technical communication is stagnant.
zh_cn: 学术界的技术传播发展并不是停滞不前。

source: It is possible that students introduced to LwDITA methodologies for creating content will be on an easier path for acquiring skills in programming and other advanced computing topics, or perhaps the students will only apply computing
zh_cn: 学会使用 LwDITA 编写内容的学生可能更容易掌握编程和其他高级计算机技能，也有可能这些学生只会在

source: It is really not much more than a long-winded Topic Index” (1976, p.
zh_cn: 它不过就是加长版的主题索引。”(1976, p.

source: It is usually well defined and restricted to a single narrow topic.
zh_cn: 它通常定义明确且主题限定在狭小范围内。

source: It may be moved to an appendix if the process is performed only once for the entire installation” (1976, p.
zh_cn: 如果在整个安装过程中，这一步骤只需执行一次则可以移至附录。“ (1976, p.

source: It provides a framework for using a learning objects approach to organize and sequence content as a learning deliverable” (Eberlein et al., 2015, pp.
zh_cn: 他提供了一种框架，能让用户使用学习对象方法来将内容组织和排序成学习交付物 (Eberlein et al., 2015, pp.

source: It requires thinking at multiple levels of abstraction” (2006, p.
zh_cn: 还需要在多个抽象层次上进行思考” (2006, p.

source: It shows how different elements of the system are used together on an intermediate level” (1976, p.
zh_cn: 展现了系统中不同元素是如何在中间级上协同使用的。 (1976, p.

source: It was a warm day in May when I interviewed John Carroll at his office on the Penn State campus, and he looked more like a Jimmy Buffett concertgoer than the patron saint of technical communicators.
zh_cn: 五月温暖和煦的一天，我在在约翰·卡罗尔位于宾州州立大学校园的办公室里采访了他，他看上去更像是一个参加吉米.巴菲特音乐会的观众，而非技术传播的守护神。

source: It was an interesting idea because people were talking back then about object-oriented software, modular units .
zh_cn: 这是个很有意思的想法，因为当时人们都在讨论面向对象的软件和模块化单元。

source: It was not supposed to be like this.
zh_cn: 它本不是这样的。

source: It was not until Priestley's blog post of April 2014 that Lightweight DITA became an umbrella term for different authoring formats 一 initially XML and HTML5, and then Markdown.
zh_cn: 直到 2014年 4月普里斯特利发表了一篇博客文章，轻量级DITA才成为不同创作格式的统称——最初是XML和HTML5，后来是Markdown。

source: It was probably me.
zh_cn: 那可能说的就是我。

source: It wasn't until we went public with DITA and people started challenging those choices that I went back and tried to understand where they came from.
zh_cn: 直到DITA面试，人们才开始质疑这些选择，而在此之前我早已追根溯源并尝试去理解它们的发展历程。

source: It does not need a title either, and it could only include a placeholder comment for future content.
zh_cn: 只有一行为日后写作内容占位的注释。

source: Italics
zh_cn: 斜体

source: Italics, which is a way to emphasize key points in a printed text or, when quoting a speaker, a way to show which words the speaker stressed.
zh_cn: 斜体（italics）在印刷文本中属于强调重点的一种方式，或者在引用演讲时，显示演讲者重读了哪些词。

source: Its element tags are enclosed in angle brackets (<element>This is element text</element>).
zh_cn: XML 元素标签包含在尖角括号内（<element>This is element text</element>）。

source: James Mathewson knows a thing or two about technical communication.
zh_cn: 詹姆斯·马修森（James Mathewson）对技术传播略知一二。

source: James took to Twitter to express his frustration after coming back empty-handed from his search for interns.
zh_cn: 詹姆斯在推特上表达了他寻求实习生却空手而归的沮丧。

source: James's tweet started a discussion about the many topics covered in courses and programs in technical communication.
zh_cn: 詹姆斯的推文引发了一场关于技术传播课程和项目中涉及的众多话题的讨论。

source: JoAnn Hackos explained that “standards development is deliberately slow and methodical.” According to Hackos:
zh_cn: 乔安· 哈克斯解释说：“标准的开发是故意安排得缓慢而又井然有序的。”哈克斯表示：

source: Joe Rigo's outline for a computer manual reflects a healthy and confident genre of technical communication in the 1970s.
zh_cn: 乔·里戈为计算机手册制定的大纲反映了20世纪70年代技术传播领域一种健康而自信的体裁。

source: John Carroll Takes the Stand
zh_cn: 约翰·卡罗尔出庭作证

source: John Hunt and Amber Swope joined the committee shortly after the first meeting.
zh_cn: 约翰·亨特和安布尔·斯沃普在第一次会议后不久就加入了委员会。

source: John M. Carroll is held responsible for some actions and decisions that have defined the academic and professional field of technical communication as we know it today.
zh_cn: 我们如今了解的定义了技术通信学术和专业领域的一些行为和决定都出自约翰·卡罗尔（John Carroll）之手

source: Johnson questioned if DITA was a product of minimalism in documentation.
zh_cn: DITA是否是极简主义应用于文档的产物，约翰逊对这一点提出了质疑。

source: Johnson-Eilola's skills for rearticulating technical communication included abstraction, which “requires students not merely to memorize information but also to learn to discern patterns, relationships, and hierarchies in large masses of information” (Johnson-Eilola, 1996, p.
zh_cn: 在约翰逊·艾劳拉的重述中，技术传播包括抽象的技能，这“要求学生不仅要记住信息，而且要学会在大量信息中辨别模式、关系和层级” (Johnson-Eilola, 1996, p.

source: Just as LwDITA defines a subset of DITA features for topics, it also defines a subset for the DITA map.
zh_cn: 它可以将话题分组。正如 LwDITA 的话题特性是 DITA 话题特性的子集一样，LwDITA 地图的特性也是 DITA 地图特性的子集。

source: Just as the original publication, DQTI focused more on recommendations than in specific topical conventions.
zh_cn: 同第一版无异， DQTI 更关注建议而非具体的主题惯例。

source: Just like Chef Pedro, who wants to create a structured template for all entries in his recipe guide, information developers at IBM started looking at XML in the late 1990s to organize technical content.
zh_cn: 就像佩德罗希望为菜谱指南中的所有条目创建结构化模板一样，IBM 的信息开发人员在20世纪90年代末开始研究使用XML组织技术内容。

source: Just like the XDITA example in Figure 6.1, the HDITA topic requires a <title> element, which I will add in the following section.
zh_cn: 与图6.1中的XDITA示例一样，HDITA话题需要 <title> 元素，我将在下一节中添加该元素。

source: Keep in mind that DITA 1.3 has 26 document types.
zh_cn: 请记住 DITA 标准1.3 版本中有26 种文档类型。

source: Keep in mind that LwDITA is a work in progress and some elements in this chapter might change between the publication of this book and the actual release of the Lightweight DITA standard.
zh_cn: 请记住，LwDITA 标准还在制定当中，本书的出版和轻量级 DITA 标准的实际发布之间有时间差异，所以本章中提到的一些元素可能会发生改变。

source: Key definition: defines a variable at the map level.
zh_cn: 关键定义（key definition）：在地图里定义一个变量。

source: Knowledge constructor
zh_cn: 知识缔造者

source: Languages that drop features that aren't used, or aren't used often.
zh_cn: 摒弃完全步用或不常用特性的语言。

source: Lastly, I discuss the tools support available, and in progress, for authors who want to create and structure content with LwDITA.
zh_cn: 最后，我将为想用LwDITA创建和构造内容的作者探讨可用的和开发中的工具支持。

source: Lastly, the <postreq> element can provide one or more actions that need to be conducted after the core steps of this specific task topic.
zh_cn: 最后，<postreq> 元素可以提供在此特定任务主题的核心步骤之后需要执行的一个或多个操作。

source: Lastly, the chapter focuses on strategies for adopting a DITA workflow in three simplified authoring formats, which are connected to principles of computational thinking and emphasize the importance of human abstraction before machine automation.
zh_cn: 最后，本章重点讨论了利用三种简化创作格式制定 DITA 工作流的策略，这些策略与计算思维原则有关，强调了在机器自动化之前人类抽象思维的重要性。

source: Layer 1: Developing quality documentation.
zh_cn: 第一层级：开发质量文档，

source: Layer 2: Separating content from design.
zh_cn: 第二层级：分离内容与样式，

source: Layer 3: Authoring granular content with XML.
zh_cn: 第三层级：用 XML 编写细粒度内容，

source: Layer 4: Authoring and linking Component Content Management modules with DITA.
zh_cn: 第四层级：使用 DITA 编写、链接组件内容管理模块，

source: Layer 5: Single sourcing and content reuse.
zh_cn: 第五层级：同源开发和内容复用，

source: Legal terms of the franchise agreement
zh_cn: 特许经营权协议的法律条款

source: Let me introduce you here to Pedro, a chef and restaurateur who is going to be the main user-author in this book's examples.
zh_cn: 下面我想向你们介绍佩德罗（Pedro），他是一名厨师，也是餐馆老板。佩德罗将是本书示例的主要用户和创作人。

source: Let's go back to Chef Pedro, who is attempting now to structure some of his own recipes as tasks following specifications from the DITA 1.3 standard.
zh_cn: 让我们回到厨师佩德罗的例子上，他现在正试图按照 DITA 标准1.3版本的规范将自己的一些菜谱组织成任务（task）话题。

source: Lightweight DITA aims to streamline the DITA authoring experience by presenting three formats for content creation:
zh_cn: 轻量级 DITA 旨在通过提供三种不同的内容写作格式来简化 DITA 创作体验：

source: Lightweight DITA can be the glue that ties together many different authoring platforms across a company.
zh_cn: 轻量级 DITA 可以将公司内不同的创作平台连接在一起，

source: Lightweight DITA is particularly attractive to companies who need a faster ROI [return on investment] and an easier learning curve.
zh_cn: 对那些需要更快的 ROI 的公司来说，轻量级 DITA 更有吸引力，也更容易学习。

source: Like DITA, Information Mapping structures content in specific types or templates.
zh_cn: 与 DITA 一样，信息映射以特定类型或模板使内容结构化。

source: Likewise, Senske reported from an effort to teach computational thinking to architecture students, based on the idea that “understanding computation and being able to express oneself computationally is not optional” (2017, p.
zh_cn: 类似地，出于希望学生们能“理解计算机原理，学会使用计算机表达自我”的想法，散斯克（Senske）在努力地教建筑学学生计算机思维 (2017, p.

source: Link text: provides a label for a link or resource.
zh_cn: 链接文本（link text）：为链接或资源提供标签。

source: List item: a single entry in an ordered or unordered list.
zh_cn: 列表项（list item）：有序或无序列表中的单个条目。

source: Lists
zh_cn: 列表组件

source: Looking, for example, at the 17 document types and 440 element types available on the technical content edition of the DITA 1.3 standard, I couldn’t stop hear- ing the voice of John Carroll from the interview I reported on Chapter 2: “All 62 How DITA Evolved Into LwDITA this being said, the manuals didn’t work.
zh_cn: 例如，在 DITA 标准1.3技术内容版本中有17种可用文档类型和440种元素类型，我不禁想到约翰•卡罗尔在第二章中提到的采访中所说的话：“这么看来手册不起作用，

source: Looking, for example, at the 17 document types and 440 element types available on the technical content edition of the DITA 1.3 standard, I couldn't stop hearing the voice of John Carroll from the interview I reported on Chapter 2: “All this being said, the manuals didn't work.
zh_cn: 例如，在 DITA 标准1.3技术内容版本中有17 种可用文档类型和440 种元素类型，我不禁想到约翰•卡罗尔在第2章中提到的采访中所说的话：“这么看来手册不起作用，

source: Loop: determines if a multimedia component should play constantly.
zh_cn: 循环（loop）：控制多媒体组件是否应该循环播放。

source: Lots of headlines, which allow the reader to “skip to the part of the book you want.”
zh_cn: 大量的标题，能让读者“跳到书中想读的部分”。

source: LwDITA does not have existing DITA users as its primary audience.
zh_cn: LwDITA 的主要用户中没有仍在使用 DITA 的用户。
